app/controllers/typos_controller.rb

SELECT * FROM "typos" ORDER BY created_at DESC
---
  def index
    @typos = Typo.all(:order => 'created_at DESC')

SELECT * FROM "typos" WHERE ("typos"."id" = 1)
UPDATE "users" SET "perishable_token" = '2JyBDiWDFZdZ5FVqhLcN', "last_request_at" = '2009-06-17 02:29:00', "updated_at" = '2009-06-17 02:29:00' WHERE "id" = 1
---
	def rate
		@typo = Typo.find(params[:id])
		@typo.rate_it(params[:rating], current_user.id)

		respond_to do |format|
			if @typo.save

SELECT * FROM "typos" WHERE ("typos"."id" = 1)
---
  def show
    @typo = Typo.find(params[:id])

INSERT INTO "typos" ("html", "name", "updated_at", "created_at") VALUES('Tester', '', '2009-06-17 18:13:30', '2009-06-17 18:13:30')
---
  def create
    @typo = Typo.new(params[:typo])

    respond_to do |format|
      if @typo.save