app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "crypted_password", "single_access_token", "perishable_token", "current_login_ip", "password_salt", "current_login_at", "failed_login_count", "persistence_token", "login_count", "login", "email", "last_login_ip", "created_at") VALUES(NULL, '2009-06-17 02:06:00', '2009-06-17 02:06:00', 'edaf30eb81a26168d9f57b684dc852ef05d4b017c0f55472863cee8e25899c6939eb349ffe4da66991e7fbb42dbbf9d703bcad7f4b32e292b221afa7f2d1d314', 'exhIzqYRYRJPFFd2GsyS', 'Hc0hsu3umRDpQy0DfUBo', '127.0.0.1', 'IWppxpdBhZpG96mX1omK', '2009-06-17 02:06:00', 0, '71211e4b78d1cbd90502f7d2353a1253670b1e280a904d37119b40e1c2d0ed8ddcddca90e0bbe97f8f361e54e882106ee434dfa1b0eb35f5ae2a86f1ee69a9b7', 1, 'kalupa', 'paul@controllercode.com', NULL, '2009-06-17 02:06:00')